app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("name", "utilisateur_id", "valider", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["utilisateur_id", 0], ["valider", "f"], ["created_at", "2016-12-19 15:37:17.851332"], ["updated_at", "2016-12-19 15:37:17.851332"]]

  def update
    respond_to do |format|
      if @image.update(image_params)
---
UPDATE "images" SET "utilisateur_id" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["utilisateur_id", 1], ["updated_at", "2016-12-20 20:14:21.787701"], ["id", 3]]